{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "prefix": "",
    "cleanup": false
  },
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<unk>": 0,
      "hello": 1,
      "world": 2
    },
    "unk_token": "<unk>"
  }
}
