{
  "_fixture_version": 1,
  "_purpose": "Distilled Hugging Face config fixture for MF.4 Qwen3.5 metadata recognition and pre-compute rejection tests.",
  "_source": {
    "repository": "Qwen/Qwen3.5-35B-A3B-FP8",
    "revision_observed": "b955db3baa2e2fe51de7455fdfa08d7c29865abd",
    "pinned_candidate_revision": "9d1823d2dee688a6b25e77009dc727688c44936e",
    "url": "https://huggingface.co/Qwen/Qwen3.5-35B-A3B-FP8/blob/b955db3baa2e2fe51de7455fdfa08d7c29865abd/config.json"
  },
  "architectures": [
    "Qwen3_5MoeForConditionalGeneration"
  ],
  "image_token_id": 248056,
  "model_type": "qwen3_5_moe",
  "text_config": {
    "dtype": "bfloat16",
    "head_dim": 256,
    "hidden_size": 2048,
    "layer_types": [
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention",
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention"
    ],
    "linear_key_head_dim": 128,
    "linear_num_key_heads": 16,
    "linear_num_value_heads": 32,
    "linear_value_head_dim": 128,
    "max_position_embeddings": 262144,
    "model_type": "qwen3_5_moe_text",
    "moe_intermediate_size": 512,
    "num_attention_heads": 16,
    "num_experts": 256,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 40,
    "num_key_value_heads": 2,
    "rms_norm_eps": 0.000001,
    "shared_expert_intermediate_size": 512,
    "vocab_size": 248320,
    "rope_parameters": {
      "mrope_interleaved": true,
      "mrope_section": [
        11,
        11,
        10
      ],
      "rope_type": "default",
      "rope_theta": 10000000,
      "partial_rotary_factor": 0.25
    }
  },
  "tie_word_embeddings": false,
  "video_token_id": 248057,
  "vision_config": {
    "depth": 27,
    "hidden_size": 1152,
    "model_type": "qwen3_5_moe",
    "num_heads": 16,
    "out_hidden_size": 2048,
    "patch_size": 16
  },
  "quantization_config": {
    "quant_method": "fp8",
    "activation_scheme": "dynamic",
    "weight_per_tensor": false,
    "act_per_tensor": false,
    "weight_block_size": [
      128,
      128
    ]
  }
}
